// mysql -u 접속할 유저 이름 -p
// 패스워드 입력하고
// 현재 있는 데이터 베이스 리스트 보는 쿼리문
// ==========================================
// show databases;
// ==========================================

// 데이터 베이스 하나 만들기 쿼리문
// =============================================
// CREATE DATABASE (테이블 명) CHARACTER SET utf8;
// =============================================

// 사용할 데이터 베이스 선택
// ===============================================
// use 데이터베이스명;
// ===============================================

// 테이블 선택 쿼리문
// ===============================================================
// SELECT * FROM `test4`.`name`;
// 여기서 * -> 이거는 전체를 의미한다
// 추가로 use 쿼리문을 통해서 들어왔으면 SELECT * FROM `name`만 적어줘도 된다.
// ===============================================================

// 테이블에 컬럼 추가 쿼리문
// ==============================================================================
// INSERT INTO `데이터베이스이름`.`테이블이름` (`id`, `contents`) VALUES ('1', '안녕');
// (`id`, `contents`) 순서대로
// ('1', '안녕') 추가할 벨류들
// ==============================================================================

// 테이블에 컬럼 삭제 쿼리문
// ==============================================================================
// DELETE FROM `데이터베이스이름`.`테이블이름` WHERE (`id` = '1');
// WHERE (`id` = '1') 아이디가 1번인 컬럼을
// ==============================================================================

// 테이블에 컬럼 수정 쿼리문
// ==============================================================================
// UPDATE `데이터베이스이름`.`테이블이름` SET 'id' = '2', `contents` = '하세요' WHERE (`id` = '1');
// 변경내용 SET 'id' = '2', `contents`
// WHERE (`id` = '1') 아이디가 1번인 컬럼을
// ==============================================================================

// 필터 선택문
// ========================================================
// SELECT `name`,`number` FROM `test4`.`name`;
// 'name'과 'number'값만 뽑아오기

// SELECT `name` FROM `test4`.`name` WHERE `number` > '200';
// 'number'값이 200 이상인 `name`값 뽑아오기

// SELECT `name` FROM `test4`.`name` WHERE `number` BETWEEN 200 AND 400;
// SELECT `name` FROM `test4`.`name` WHERE `number` >= 200 AND `number` <=400;
// 'number'값이 200과 400 사이인 'name'값 뽑아오기

// SELECT `name` FROM `test4`.`name` WHERE `name` = '민섭';
// ========================================================

// 명령어 정리 사이트 https://lgphone.tistory.com/85

// 워크벤치 쿼리문
// ==========================================================
// select * from test4.posts;
// 선택, test.posts -> 스키마이름.테이블이름
// select contents from test4.posts
// 선택한테이블에서 특정 값만 가져오기

// insert into test4.posts (id,contents) values ('3','바이')
// 컬럼추가, id값->3으로, contents값->'바이'로

// update test4.posts set id='7', contents='바뀜' where (id='2');
// 컬럼수정, id2번 컬럼을 id값->7로, contents값->'바뀜'으로 변경
// ==========================================================
