/*
1. git 설정 =====================================================
사용자 설정
깃을 사용할때 사용하는 것이 사용자 세팅
git config --global user.name "본인깃네임"
git config -- global user.email "본일 이메일"

설정된 정보 조회
git config --global --list

git 저장소 초기화 및 생성
git의 저장소로 지정할 폴더로 이동해서
git init

git 저장소 복제(파일 내려받기)
git clone (url)

git 저장소 추가
git remote-add origin "git저장소 url"

git 사용
스테이징에 추가
git add 파일명(확장자 까지)

커밋 메세지
git commit -m "커밋이름"

브렌치 목록 전부보기
git branch -r

로컬 깃 브렌치 목록 전부보기
git branch -a

현재 브렌치 변경
git switch "브렌치 이름"

브렌치 추가
git branch "추가하고싶은 브렌치 이름"

브렉치 제거
git branch -d "제거할 브렌치 이름"
======================================================================
======================================================================
2.README 작성
글씨의 크기
#을 입력하고 한칸뛰우고 뒤에 글씨를 작성
#은 5개까지 입력할 수 있음 
#갯수가 많을수록 글자사이즈 줄어듦

코드사용
```사용할언어이름  (```javascript)
코드내용 작성하고
닫을때 다시 ```

링크사용
링크를 넣고싶으면
[링크의 이름] 표시될 링크의 문자
(url) 접속할 주소

목록추가
*로 목록 표현 (별 뒤에 띄어쓰기)
탭눌러서 들여쓰기하면 목록형식 바뀜

테이블 추가
|, --- 이걸로 구분할 수 있다.
형태는
1 | 2 | 3
---|---|---
제목 | 이름 | 날짜

이미지 추가
이슈탭에 가서 새로운 이슈 생성
쓰기창에서 이미지를 드래그 해서 넣으면
![180px-Basketball](https://user-images.githubusercontent.com/107898015/174937289-7ba395ca-51f0-4f6c-8a7f-c632ecb32f7b.png)
이런 형식으로 뜨는데
이걸 그대로 복사해서 리드미파일에 붙여넣으면 된다.
ok
*/
