// Go를 설치하는 이유
// Geth를 빌드하는데 필요한 언어
// Geth => go-ethereum의 약자임
// Geth는 Go언어로 만들어진 이더리움 클라이언트 소프트웨이 이다.
// 권한이 필요한 명령어를 사용할때 앞에 sudo를 붙힌다.

// Go 설치
// ===================================================================
// brew install go
// ===================================================================

// Go 업데이트 하기

// Geth 설치
// ===================================================================
// brew install ethereum
// ===================================================================
// 혹은 geth 홈페이지 들어가서 다운로드하고 압출푸고 나온 geth 파일 usr/src/bin 폴더 안에 넣어주기

// Geth 실행
// iterm 켜서 geth 치면 실행됨

// 가나쉬 설치
// ===================================================================
// npm i -g ganache-cli
// ===================================================================
// 실행
// ===================================================================
// npx ganache-cli
// ===================================================================
// 가나쉬 로컬에서 이더리움 블록체인 가상 네트워크를 생성할수있께 해준다.
// 테스트할수있게 해주너ㅡㄴ거
// 가나쉬로 생성된 네트워크에서는 채굴기능, p2p기능이 없음
// 블록 /체인 /Tx 와 관련된 기능만 있다.
// 1tx에 1개의 블록 생성
// 가나쉬로 트랜젝션을 ㅂ라생시키면 실시간 확인이 가능해서 테스트에 용이하다.
